Конфигурация/Documents/НачислениеЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.ВводДенежныхСредств</xr:Item>
				<xr:Item>Document.РасчетНДФЛ</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.РазмещениеКредитногоИнструмента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеДоходыИРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вознаграждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКлиентскомуОтноситьНаДатуОплаты</Name>
					<Comment>По клиентскому учету относить на дату оплаты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогИлиВзнос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалогиИВзносы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачестьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПоОбщимРасходам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предварительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Арендатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураСводный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыВходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетБрокера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
					<Comment>Универсальный передаточный документ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/НачислениеЗадолженности/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ПараметрыПерезаполнения") Тогда // перезаполним документ на основании
		ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
		ОбъектНаСервере.Основания.Очистить();
		ОбъектНаСервере.Заполнить(ЭтаФорма.Параметры.ПараметрыПерезаполнения.Основание);
		
		ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();
	
	Если ПараметрыЗаписи.Свойство("НомерАктаВыданногоВДопСведения") Тогда
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "НомерАктаВыданного", ЭтаФорма.НомерАктаВыданного);	
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("НомерСчетаВыданногоВДопСведения") Тогда
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "НомерСчетаВыданного", ЭтаФорма.НомерСчетаНаОплатуВыданного);	
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ВидДополнительногоДокументаВДопСведения") Тогда
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "ВидДополнительногоДокумента", ЭтаФорма.ВидДополнительногоДокумента);	
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("НомерДополнительногоДокументаВДопСведения") Тогда
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "НомерДополнительногоДокумента", ЭтаФорма.НомерДополнительногоДокумента);	
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ДатаДополнительногоДокументаВДопСведения") Тогда
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "ДатаДополнительногоДокумента", ЭтаФорма.ДатаДополнительногоДокумента);
	КонецЕсли;
	
	ЗаполнитьДополнительныеКолонкиНаСервере();// после записи теряются значения реквизитов, добавленных к т.ч. объекта
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();

	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ДатаОплатыВТабличнойЧасти(Объект.ВидЗадолженности) Тогда
		Для Каждого СтрокаОснования Из Объект.Основания Цикл
			СтрокаОснования.ДатаОплаты = ПлановаяДатаОплаты;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.НомерАктаВыданного) Тогда
			ПараметрыЗаписи.Вставить("НомерАктаВыданногоВДопСведения");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма.НомерСчетаНаОплатуВыданного) Тогда
			ПараметрыЗаписи.Вставить("НомерСчетаВыданногоВДопСведения");	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма.ВидДополнительногоДокумента) Тогда
			ПараметрыЗаписи.Вставить("ВидДополнительногоДокументаВДопСведения");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма.НомерДополнительногоДокумента) Тогда
			ПараметрыЗаписи.Вставить("НомерДополнительногоДокументаВДопСведения");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма.ДатаДополнительногоДокумента) Тогда
			ПараметрыЗаписи.Вставить("ДатаДополнительногоДокументаВДопСведения");
		КонецЕсли;
				
	Иначе
		
		ПоручениеСсылка = РаботаСДокументами.ПолучитьПодчиненныйДокументПоручениеНаВыводАктивов(Объект);
			
		Если ПоручениеСсылка <> Неопределено 
			И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
				Или Не РаботаСДокументами.ЗначенияРеквизитовСоответствуютОснованиюПоручения(ПоручениеСсылка, ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "СчетДоверительногоУправления, ВидЗадолженности, Брокер, Валюта, МестоХранения, Основания"), Ложь)) Тогда
		
			Если Вопрос("На основании начисления задолженности сформировано поручение на движение денежных средств.
						|Поручение будет отменено. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда 
			
				РаботаСБизнесПроцессамиИЗадачами.ЗавершитьБизнесПроцессИОтменитьПоручение(Объект.Организация, ПоручениеСсылка, Отказ); 
			Иначе
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
					
	КонецЕсли;		
				
	ТекущийОбъект = Объект;
	
	Если СодержаниеИспользуетсяДляХраненияДанных(ТекущийОбъект.ВидЗадолженности) Тогда
		СформироватьСтруктуруПараметровРасчета(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = ЗначениеПереключателяБрокер() И Не ЗначениеЗаполнено(Объект.Брокер) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Брокер"" не заполнено",, "Объект.Брокер",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.РасчетныйСчет)
		И ЭтаФорма.ДетализацияПоРасчетномуСчету
		И ЭтаФорма.ОплатаЧерезБрокера <> ЗначениеПереключателяБиржа()
		И Объект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ")
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Расчетный счет"" не заполнено",, "Объект.РасчетныйСчет",, Отказ);
	КонецЕсли;
	
	Если ЭтаФорма.ВходящийДокумент Тогда
		Если Не ЗначениеЗаполнено(Объект.ВидВходящегоДокумента) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Вид входящего документа"" не заполнено",, "Объект.ВидВходящегоДокумента",, Отказ);
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Объект.НомерВходящегоДокумента) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Номер входящего документа"" не заполнено",, "Объект.НомерВходящегоДокумента",, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Дата входящего документа"" не заполнено",, "Объект.ДатаВходящегоДокумента",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтаФорма.ВозмещениеПоАренде И Не ЗначениеЗаполнено(Объект.Арендатор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Арендатор"" при возмещении по аренде не заполнено",, "Объект.Арендатор",, Отказ);
	КонецЕсли;
	
	ТекстСообщения = "";
    
	Если Справочники.ВидыЗадолженности.ТребуетсяУказаниеПериодаНачисленияЗадолженности(
				Объект.Организация,
				Объект.ВидЗадолженности,
				Объект.Дата,
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления"))
		И Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ПериодНачисления,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "ПериодНачисления", Отказ); 	
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);

	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.ОплатаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"),
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		УстановитьПлановуюДатуОплаты();
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЧерезБрокераПриИзменении(Элемент)
	
	Объект.Брокер		 = Неопределено;
	Объект.МестоХранения = Неопределено;
	
	Если ЭтаФорма.ОплатаЧерезБрокера = ЗначениеПереключателяБиржа() Тогда
		Объект.МестоХранения = ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК");
	КонецЕсли;
		
	БрокерПриИзменении(Неопределено);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиПриИзменении(Элемент)
	
	Если Объект.Основания.Количество() > 0 Тогда
		Если Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Объект.Основания.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДополнительныеКолонкиНаСервере();
	
	Если Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего")
		ИЛИ Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего")
	Тогда
		Объект.Контрагент 	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо");
		Объект.МестоХранения = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.ПрочиеДоходыИРасходы)  Тогда
		Объект.ПрочиеДоходыИРасходы = ПолучитьПрочиеДоходыИРасходы(Объект);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
	    Объект.ГруппаФинансовогоУчетаДоходовРасходов = ПолучитьГруппуФинансовогоУчетаДоходовРасходов(
															Объект.Дата,
															Объект.Организация,
															Объект.СчетДоверительногоУправления,
															Объект.ВидЗадолженности,
															Объект.ПрочиеДоходыИРасходы);
	КонецЕсли;	
	
	Элементы.ОснованияДатаОплаты.Заголовок = "Дата оплаты " + НРег(Объект.ВидЗадолженности);
	
	УстановитьСвойстваНДСНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	Объект.ДополнительнаяАналитика = ПолучитьДополнительнуюАналитику(Объект.Договор);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЭтаФорма.ДепозитарийКонтрагента = ПолучитьДепозитарийКонтрагента(Объект.Контрагент);
	ОбновитьКППНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(Объект.НачалоПериодаНачисления, Объект.ОкончаниеПериодаНачисления);
    
	Если Диалог.Редактировать() Тогда
		ЭтаФорма.ПериодНачисления.ДатаНачала	= Диалог.Период.ДатаНачала;
		ЭтаФорма.ПериодНачисления.ДатаОкончания	= Диалог.Период.ДатаОкончания;
		
		ПериодНачисленияПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)

	Объект.НачалоПериодаНачисления		= ЭтаФорма.ПериодНачисления.ДатаНачала;
	Объект.ОкончаниеПериодаНачисления	= ЭтаФорма.ПериодНачисления.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийДокументПриИзменении(Элемент)
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Объект.Договор = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	Объект.ДополнительнаяАналитика = ПолучитьДополнительнуюАналитику(Объект.Договор);
	
	УстановитьПлановуюДатуОплаты();
	
	УстановитьСвойстваНДСНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПлановуюДатуОплаты()
	
	НоваяПлановаяДатаОплаты = ПолучитьДатуОплатыПоДоговору(Объект.Дата, Объект.Договор);
	Если ЗначениеЗаполнено(НоваяПлановаяДатаОплаты) Тогда
		Если НЕ ЗначениеЗаполнено(ПлановаяДатаОплаты) Тогда
			ПлановаяДатаОплаты = НоваяПлановаяДатаОплаты;
		ИначеЕсли ПлановаяДатаОплаты <> НачалоДня(НоваяПлановаяДатаОплаты) Тогда
			Если Вопрос("Изменить плановую дату оплаты на " + Формат(НоваяПлановаяДатаОплаты, "ДФ=dd.MM.yyyy") + "?", РежимДиалогаВопрос.ДаНет, 60) = КодВозвратаДиалога.Да Тогда
				ПлановаяДатаОплаты = НоваяПлановаяДатаОплаты;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеДоходыИРасходыПриИзменении(Элемент)
	
	ГруппаФинансовогоУчетаДоходовРасходов = ПолучитьГруппуФинансовогоУчетаДоходовРасходов(
												Объект.Дата,
												Объект.Организация,
												Объект.СчетДоверительногоУправления,
												Объект.ВидЗадолженности,
												Объект.ПрочиеДоходыИРасходы);
	
	Если НЕ ЗначениеЗаполнено(Объект.ГруппаФинансовогоУчетаДоходовРасходов) ИЛИ 
		(ГруппаФинансовогоУчетаДоходовРасходов <> Объект.ГруппаФинансовогоУчетаДоходовРасходов И 
		Вопрос("Перезаполнить группу финансового учета доходов и расходов?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
	    Объект.ГруппаФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуНДС(Элементы.Основания.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОснованияСуммаПриИзменении(Элемент)
	
	РассчитатьСуммуНДС(Элементы.Основания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияБазаИСтавкаНалогаПриИзменении(Элемент)
	
	РассчитатьСуммуНалога(Элементы.Основания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияРасчетПоКадастровойСтоимостиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Основания.ТекущиеДанные;	
	ТекущиеДанные.ОбъектРасчетаНалогаНаИмущество = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияОбъектРасчетаНалогаНаИмуществоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Основания.ТекущиеДанные;
	
	Если ТекущиеДанные.ОбъектРасчетаНалогаНаИмущество <> "" Тогда	
		
		ТекущиеДанные.ЦеннаяБумага = ПолучитьОбъектНедвижимостиПоОКТМОНаСервере(Объект.Организация, Объект.СчетДоверительногоУправления, ТекущиеДанные.ОбъектРасчетаНалогаНаИмущество, Объект.Дата);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ЦеннаяБумага) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден объект недвижимости с кодом ОКАТО " + ТекущиеДанные.ОбъектРасчетаНалогаНаИмущество);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.ОплатаЧерезБрокера);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоНалогуНаИмущество(Команда)
	
	Если Объект.Основания.Количество()>0 Тогда
		Если Вопрос("Очистить табличную часть документа?", РежимДиалогаВопрос.ДаНет,60) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	КомандаЗаполнитьПоНалогуНаИмуществоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьПоНалогуНаИмуществоНаСервере()
	
	Отказ = Ложь;
	
	Объект.Основания.Очистить();
	
	РасчетНалогаНаИмущество = РаботаСНалогамиКлиентСервер.РассчитатьНалогНаИмущество(Объект.ОкончаниеПериодаНачисления, Объект.Организация, Объект.СчетДоверительногоУправления, Отказ, Ложь);
	
	Для Каждого СтрокаРасчета Из РасчетНалогаНаИмущество  Цикл
		
		Строка = Объект.Основания.Добавить();
		Строка.ЦеннаяБумага = СтрокаРасчета.ОбъектНедвижимости;
		Строка.БазаНалога = СтрокаРасчета.БазаНалога;
		Строка.СтавкаНалога = СтрокаРасчета.СтавкаНалога;
		Строка.Сумма = СтрокаРасчета.СуммаНалога - СтрокаРасчета.СуммаАванса;
		Строка.АвансПоНалогу = СтрокаРасчета.СуммаАванса;
		Строка.РасчетПоКадастровойСтоимости = СтрокаРасчета.РасчетПоКадастровойСтоимости;
		Строка.ОбъектРасчетаНалогаНаИмущество = СтрокаРасчета.КодОКТМО;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте 
Процедура РассчитатьСуммуНДС(ТекущиеДанные)
	
	СтавкаНДС = РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(ТекущиеДанные.СтавкаНДС);

	ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * СтавкаНДС/(100 + СтавкаНДС);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ЭтоКредиторскаяЗадолженность(ВидЗадолженности)
	Возврат Справочники.ВидыЗадолженности.ОпределитьТипЗадолженности(ВидЗадолженности) = Перечисления.ТипыЗадолженности.Кредиторская;
КонецФункции

&НаСервереБезКонтекста
Функция НуженВходящийДокумент(ОбъектФормы)
	Объект = ДанныеФормыВЗначение(ОбъектФормы, Тип("ДокументОбъект.НачислениеЗадолженности"));
	Возврат Объект.НуженВходящийДокумент();
КонецФункции

&НаСервереБезКонтекста
Функция ДоступноПредварительноеНачисление(Объект)
	Возврат Справочники.ВидыЗадолженности.ВидыЗадолженностиСПредварительнымНачислением(Объект.Организация, Объект.Дата).Найти(Объект.ВидЗадолженности) <> Неопределено;	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоИсходящаяУслуга(ВидЗадолженности)
	Возврат Справочники.ВидыЗадолженности.ЭтоИсходящаяУслуга(ВидЗадолженности);
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоПеревыставляемаяУслуга(ВидЗадолженности)
	Возврат Справочники.ВидыЗадолженности.ЭтоПеревыставляемаяУслуга(ВидЗадолженности);
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныПолныеПрава()
	Возврат РольДоступна(Метаданные.Роли.ПолныеПрава);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.МестоХранения.Доступность = (Форма.ОплатаЧерезБрокера <> ЗначениеПереключателяБиржа());
	
	Элементы.Брокер.Видимость = (Форма.ОплатаЧерезБрокера = ЗначениеПереключателяБрокер());
	
	// основания и ценные бумаги
	Элементы.ОснованияОснование.Видимость =
		(Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоТорговойКомиссии")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение")
			Или ПринадлежитГруппеЗадолженностей(Объект.ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.НДФЛ"))			
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль"));
			
	Элементы.ОснованияЦеннаяБумага.Видимость =
		(Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоТорговойКомиссии")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль")
			Или ПринадлежитГруппеЗадолженностей(Объект.ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.НДФЛ")));
			
	ЭтоНалог = ЭтоНалог(Объект.ВидЗадолженности);
	
	ЭтоНалогНаИмущество = Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНалогуНаИмущество");
	
	Элементы.КомандаЗаполнитьПоНалогуНаИмущество.Видимость = ЭтоНалогНаИмущество;
	
	Если ЭтоНалог Тогда
		
		Элементы.ОснованияСумма.Заголовок = "Сумма";
				
		Если ЭтоНалогНаИмущество Тогда
			Элементы.ОснованияЦеннаяБумага.Заголовок = "Объект недвижимости";
		КонецЕсли;
		
	Иначе
		Элементы.ОснованияСумма.Заголовок = "Сумма с НДС";
		Элементы.ОснованияЦеннаяБумага.Заголовок = "Ценная бумага";
	КонецЕсли;
		
	//НДС		
	ЭтоКредиторскаяЗадолженность = ЭтоКредиторскаяЗадолженность(Объект.ВидЗадолженности);
	ЭтоИсходящаяУслуга = ЭтоИсходящаяУслуга(Объект.ВидЗадолженности);
	ЭтоПеревыставляемаяУслуга = ЭтоПеревыставляемаяУслуга(Объект.ВидЗадолженности);
	//в 2022 году оформили предварительные по аренде с НДС. Это ошибка, но исправлять поздно, а в докумнте надо показать как есть.
	Элементы.ОснованияСтавкаНДС.Видимость 	= НЕ (Объект.Предварительно ИЛИ ЭтоНалог) ИЛИ (Объект.Дата < Дата(2023,1,1)) И (ЭтоИсходящаяУслуга И НЕ ЭтоПеревыставляемаяУслуга);
	Элементы.ОснованияСуммаНДС.Видимость 	= НЕ (Объект.Предварительно ИЛИ ЭтоНалог) ИЛИ (Объект.Дата < Дата(2023,1,1)) И (ЭтоИсходящаяУслуга И НЕ ЭтоПеревыставляемаяУслуга);
	
	Элементы.ОснованияСодержание.Видимость = Форма.ВестиУчетНДС И НЕ СодержаниеИспользуетсяДляХраненияДанных(Объект.ВидЗадолженности);
	Элементы.ГруппаСчетФактура.Видимость = Форма.ВестиУчетНДС И Не Объект.Предварительно;
	Элементы.ГруппаНДС.Видимость = Форма.ВестиУчетНДС И ЭтоКредиторскаяЗадолженность;
	Элементы.НомерСчетаФактуры.Заголовок = "Счет-фактура " + ?(ЭтоКредиторскаяЗадолженность, "полученный", "выданный") + " №";
	Элементы.КомандаПрисвоитьНомерСчетаФактурыВыданного.Видимость = ЭтоИсходящаяУслуга;
	Если Элементы.ГруппаСчетФактура.Видимость 
		И Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда 
		Элементы.СчетФактураСводный.Видимость = Истина;
	КонецЕсли;
	Элементы.НомерАктаВыданного.Видимость = ЭтоИсходящаяУслуга;
	Элементы.НомерСчетаНаОплатуВыданного.Видимость = ЭтоИсходящаяУслуга;
	Элементы.ГрузоотправительНужен.Видимость = Форма.ВестиУчетНДС И Не Объект.Предварительно И ЭтоКредиторскаяЗадолженность;
	Элементы.Грузоотправитель.Видимость = Форма.ВестиУчетНДС И Не Объект.Предварительно И ЭтоКредиторскаяЗадолженность
				И Форма.ГрузоотправительНужен;
	Элементы.КПП.Видимость = Форма.ВестиУчетНДС И Не Объект.Предварительно И ЭтоКредиторскаяЗадолженность;
	
	Элементы.РасчетныйСчетКонтрагента.Видимость = РаботаСДокументами.ОбязательноЗаполнениеРасчетногоСчетаКонтрагентаВНачисленииЗадолженности(Объект);
	
	// входящий документ
	ВидимостьВходящийДокумент = НуженВходящийДокумент(Объект);
	Если НЕ ВидимостьВходящийДокумент Тогда
		Форма.ВходящийДокумент = Ложь;
	КонецЕсли;
	Элементы.ВходящийДокумент.Видимость = ВидимостьВходящийДокумент;
	Элементы.ВидВходящегоДокумента.Видимость   = Форма.ВходящийДокумент;
	Элементы.НомерВходящегоДокумента.Видимость = Форма.ВходящийДокумент;
	Элементы.ДатаВходящегоДокумента.Видимость  = Форма.ВходящийДокумент;
	
	// Период, за который начисляется задолженность 
	Элементы.ПериодНачисления.Видимость = ЗначениеЗаполнено(Форма.ПериодНачисления) 
		Или ТребуетсяУказаниеПериодаНачисленияЗадолженности(Объект.Организация, Объект.ВидЗадолженности, Объект.Дата, Объект.СчетДоверительногоУправления);
			
	Элементы.Предварительно.Видимость = ДоступноПредварительноеНачисление(Объект) И Элементы.ПериодНачисления.Видимость;
	
	// элементы, зависящие от детализации по р/с
	Если Форма.ОплатаЧерезБрокера = ЗначениеПереключателяБиржа() Тогда
		Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствам.Видимость	= Ложь;
		Элементы.РасчетныйСчет.Видимость								= Ложь;
	Иначе
		РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
	КонецЕсли;
	
	Элементы.Договор.Видимость =
		(Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии") 
			Или ПринадлежитГруппеЗадолженностей(Объект.ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия"))
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПрочимУслугам")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПрочимДоходам")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецрегистратора")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыПоВознаграждениюОценщика")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыПоСодержаниюНедвижимости")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыНаКоммунальныеУслуги")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоУслугамПрочегоИспользованияИмущества")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоУлучшениюОбъектовНедвижимости")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоАренде")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоАрендеПеременнаяЧасть")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПолучениюВАренду")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоИнымДоходамПоИмуществу")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВозмещениюСтраховыхПремий")
			Или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоРекламе"));
			
			
	ПараметрыВыбораДоговора = Новый Массив;
	МассивТиповДоговоров	= Новый Массив;
	МассивТиповДоговоров.Добавить(Тип("СправочникСсылка.Договоры"));
			
	Если Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии")
		ИЛИ ПринадлежитГруппеЗадолженностей(Объект.ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия")) Тогда
		
		МассивВидовДоговоров = Новый Массив;
		МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ВеденияРеестра"));
		МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДепозитарногоОбслуживания"));
		МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания"));
		МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СпецРегистрационногоОбслуживания"));
		
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", МассивВидовДоговоров));
		
	ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыПоВознаграждениюОценщика") Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Оценки")));
		
	ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецрегистратора") Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СпецРегистрационногоОбслуживания")));
		
	ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоАренде") 
		ИЛИ Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПолучениюВАренду") Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Аренды")));
		
	ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВозмещениюСтраховыхПремий") Тогда
		ПараметрыВыбораДоговора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДоговорСтрахования")));	
		
	КонецЕсли;
	
	Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДоговора);
	Элементы.Договор.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповДоговоров);
	
	// плановая дата оплаты
	Элементы.ОснованияДатаОплаты.Видимость = ДатаОплатыВТабличнойЧасти(Объект.ВидЗадолженности);
	Элементы.ПлановаяДатаОплаты.Видимость  = НЕ ДатаОплатыВТабличнойЧасти(Объект.ВидЗадолженности);
			
	Элементы.ДополнительнаяАналитика.Видимость =
		Элементы.Договор.Видимость И ЗначениеЗаполнено(Объект.Договор)
			И ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.Договоры")
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВидДоговора") = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДоговорСтрахования"); 
			
	Если Элементы.Найти("ФормаОбщаяКомандаПровестиПоБухгалтерскомуУчету") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаПровестиПоБухгалтерскомуУчету.Видимость = НЕ БухгалтерскийУчет.ВидЗадолженностиСвязанСПартиями(Объект.ВидЗадолженности);
	КонецЕсли;
	
	Если Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		Элементы.ВозмещениеПоАренде.Видимость = Истина;
		Элементы.СтраницаВозмещениеПоАренде.Видимость = Форма.ВозмещениеПоАренде; 
	Иначе
		Элементы.ВозмещениеПоАренде.Видимость = Ложь;
		Элементы.СтраницаВозмещениеПоАренде.Видимость = Ложь;
	КонецЕсли;	
	
	Элементы.ГруппаДанныеДополнительногоДокумента.Видимость = Форма.ДополнительныйДокумент;
	
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();
		
		ПутьКДаннымСкрываемыхПолей.Вставить("ПериодНачисления"       , РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("ПериодНачисления, Объект.НачалоПериодаНачисления, Объект.ОкончаниеПериодаНачисления", ",", Истина, Истина));
		ПутьКДаннымСкрываемыхПолей.Вставить("ВидВходящегоДокумента"  , "Объект.ВидВходящегоДокумента");
    	ПутьКДаннымСкрываемыхПолей.Вставить("НомерВходящегоДокумента", "Объект.НомерВходящегоДокумента");
		ПутьКДаннымСкрываемыхПолей.Вставить("ДатаВходящегоДокумента" , "Объект.ДатаВходящегоДокумента");
		ПутьКДаннымСкрываемыхПолей.Вставить("НомерСчетаФактуры" 	 , "Объект.НомерСчетаФактуры");
		ПутьКДаннымСкрываемыхПолей.Вставить("ДатаСчетаФактуры" 	 	 , "Объект.ДатаСчетаФактуры");
		ПутьКДаннымСкрываемыхПолей.Вставить("Договор"                , "Объект.Договор");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияОснование"     , "Объект.Основания.Основание");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияЦеннаяБумага"  , "Объект.Основания.ЦеннаяБумага");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияСтавкаНДС" 	 , "Объект.Основания.СтавкаНДС");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияСуммаНДС" 	 , "Объект.Основания.СуммаНДС");
		ПутьКДаннымСкрываемыхПолей.Вставить("Предварительно"  		 , "Объект.Предварительно");
		ПутьКДаннымСкрываемыхПолей.Вставить("Грузоотправитель"  	 , "Объект.Грузоотправитель");
			
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДатаОплатыВТабличнойЧасти(ВидЗадолженности)
	
	Возврат ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоТорговойКомиссии")
			ИЛИ ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии");

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДепозитарийКонтрагента(Контрагент)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ПредопределенноеЗначение("Справочник.ДепозитарныеКомпании.ПустаяСсылка");
	Иначе
		Возврат Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Контрагент, "ДепозитарныеКомпании");
	КонецЕсли;
	
КонецФункции // ПолучитьДепозитарийКонтрагента

&НаСервереБезКонтекста
Функция ПолучитьПрочиеДоходыИРасходы(Знач Объект)
	
	Если Объект.Предварительно Тогда
		Возврат Справочники.ВидыЗадолженности.ПолучитьАналитикуДляПредварительныхНачисленийПоВидуЗадолженности(Объект.ВидЗадолженности);
	ИначеЕсли Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии Тогда
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ОбщРасхПоУслугамБрокера");
	ИначеЕсли Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоДепозитарнойКомиссии
		ИЛИ ПринадлежитГруппеЗадолженностей(Объект.ВидЗадолженности, Справочники.ВидыЗадолженности.ДепозитарнаяКомиссия) Тогда 	
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ОбщРасхПоУслугамДепозитария");
	ИначеЕсли Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии
		ИЛИ ПринадлежитГруппеЗадолженностей(Объект.ВидЗадолженности, Справочники.ВидыЗадолженности.БанковскаяКомиссия) Тогда 	
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_КомиссияБанка");
	ИначеЕсли Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоРекламе Тогда
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_РасходыСвязанныеСРекламой");
	ИначеЕсли Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПолучениюВАренду Тогда
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_РасходыПоПолучениюВАренду");
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
		Возврат БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ВидЗадолженности, Перечисления.ВидыУчета.БухгалтерскийУчет, "Аналитика");
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГруппуФинансовогоУчетаДоходовРасходов(Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, ПрочиеДоходыИРасходы)

	Если ЗначениеЗаполнено(ВидЗадолженности) Тогда
		
		Возврат БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаПоПрочимДоходамРасходам(
										Дата,
										Организация,
										СчетДоверительногоУправления,
										ВидЗадолженности,
										ПрочиеДоходыИРасходы);
		
	КонецЕсли; 

КонецФункции // ПолучитьГруппуФинансовогоУчетаДоходовРасходов()

&НаСервереБезКонтекста
Функция ПринадлежитГруппеЗадолженностей(ВидЗадолженности, Группа)
	Если НЕ ЗначениеЗаполнено(ВидЗадолженности) Тогда
		Возврат Ложь;
	Иначе
		Возврат ВидЗадолженности.ПринадлежитЭлементу(Группа);
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Ссылка, ИмяКлюча, Значение) 
	
	ВариантыКлюча = РедактируемыеДополнительныеСведения();
	Если ВариантыКлюча.Найти(ИмяКлюча) = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано сохранение дополнительного сведения с ключом """ + ИмяКлюча + """");
		Возврат;
	КонецЕсли;
	
	ПланыВидовХарактеристик.ДополнительныеСведения.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Ссылка, ИмяКлюча, Значение);
			
КонецПроцедуры

&НаСервере
Функция ДанныеДокументаИзДопСведенийНаСервере(Ссылка, ИмяКлюча) 
	
	ВариантыКлюча = РедактируемыеДополнительныеСведения();
	
	Если ВариантыКлюча.Найти(ИмяКлюча) = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано получение из дополнительных сведений по ключу """ + ИмяКлюча + """");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(Неопределено, ИмяКлюча, Ссылка);
			
КонецФункции 

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.ВходящийДокумент             = ЗначениеЗаполнено(Объект.ВидВходящегоДокумента);
	ЭтаФорма.ВозмещениеПоАренде           = ЗначениеЗаполнено(Объект.Арендатор) Или ЗначениеЗаполнено(Объект.ДоговорАренды);
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	
	ЭтаФорма.ОплатаЧерезБрокера           = ОпределитьЗначениеПереключателя(Объект.Брокер, Объект.МестоХранения);
	ЭтаФорма.ДепозитарийКонтрагента       = ПолучитьДепозитарийКонтрагента(Объект.Контрагент);
	ЭтаФорма.ПериодНачисления			  = Новый СтандартныйПериод(Объект.НачалоПериодаНачисления, Объект.ОкончаниеПериодаНачисления);	
	ЭтаФорма.ВестиУчетНДС				  = РаботаСНДС.ВестиУчетНДС(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.НомерАктаВыданного		  		= ДанныеДокументаИзДопСведенийНаСервере(Объект.Ссылка, "НомерАктаВыданного");
		ЭтаФорма.НомерСчетаНаОплатуВыданного 	= ДанныеДокументаИзДопСведенийНаСервере(Объект.Ссылка, "НомерСчетаВыданного");
		
		ЭтаФорма.ВидДополнительногоДокумента 	= ДанныеДокументаИзДопСведенийНаСервере(Объект.Ссылка, "ВидДополнительногоДокумента");
		ЭтаФорма.НомерДополнительногоДокумента 	= ДанныеДокументаИзДопСведенийНаСервере(Объект.Ссылка, "НомерДополнительногоДокумента");
		ЭтаФорма.ДатаДополнительногоДокумента 	= ДанныеДокументаИзДопСведенийНаСервере(Объект.Ссылка, "ДатаДополнительногоДокумента");
		
		ЭтаФорма.ДополнительныйДокумент = Не ПустаяСтрока(ЭтаФорма.ВидДополнительногоДокумента);	
	КонецЕсли;
	
	Элементы.ОснованияДатаОплаты.Заголовок = "Дата оплаты " + НРег(Объект.ВидЗадолженности);
	
	Если НЕ ДатаОплатыВТабличнойЧасти(Объект.ВидЗадолженности) Тогда
		Если Объект.Основания.Количество() > 0 Тогда
			ПлановаяДатаОплаты = Объект.Основания[0].ДатаОплаты;
		КонецЕсли;
	КонецЕсли;

	ЭтаФорма.ГрузоотправительНужен = ЗначениеЗаполнено(Объект.Грузоотправитель);
	Если ЭтаФорма.ВестиУчетНДС Тогда
		ЭтаФорма.Элементы.ВидВходящегоДокумента.РежимВыбораИзСписка = Истина;
		ЭтаФорма.Элементы.ВидВходящегоДокумента.СписокВыбора.Очистить();
		// счет-фактура указывается в отдельном реквизите
		Для сц = 0 по Перечисления.ВидыВходящихДокументов.Количество()-1 Цикл
			ТекВидВходящегоДокумента = Перечисления.ВидыВходящихДокументов.Получить(сц);
			Если ТекВидВходящегоДокумента <> Перечисления.ВидыВходящихДокументов.СчетФактура Тогда 
				ЭтаФорма.Элементы.ВидВходящегоДокумента.СписокВыбора.Добавить(ТекВидВходящегоДокумента);
			КонецЕсли;
		КонецЦикла;
		
		ОбновитьКППНаСервере();
	Иначе
		ЭтаФорма.Элементы.ВидВходящегоДокумента.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
	
	ЗаполнитьДополнительныеКолонкиНаСервере();	
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДополнительнуюАналитику(Договор)
	
	Если ЗначениеЗаполнено(Договор)
		И ТипЗнч(Договор) = Тип("СправочникСсылка.Договоры")
		И Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДоговорСтрахования") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВозвратСтраховойПремии");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуОплатыПоДоговору(ДатаЗадолженности, Договор)
	
	Возврат Справочники.Календари.ПолучитьДатуОплаты(ДатаЗадолженности, Договор);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТребуетсяУказаниеПериодаНачисленияЗадолженности(Организация, ВидЗадолженности, Дата, СчетДоверительногоУправления)
	
	Возврат Справочники.ВидыЗадолженности.ТребуетсяУказаниеПериодаНачисленияЗадолженности(
				Организация,
				ВидЗадолженности,
				Дата,
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления"));
	
КонецФункции

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваНДСНаСервере()
	
	Если НЕ ЭтоКредиторскаяЗадолженность(Объект.ВидЗадолженности) Тогда
		Объект.ЗачестьНДС = Ложь;
		Объект.НДСВключатьВСтоимость = Ложь;
		Объект.НДСПоОбщимРасходам = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаПрисвоитьНомерСчетаФактурыВыданногоНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если НЕ ЗначениеЗаполнено(ОбъектНаСервере.ДатаСчетаФактуры) Тогда
		ОбъектНаСервере.ДатаСчетаФактуры = ОбъектНаСервере.Дата;
	КонецЕсли;
	
	ОбъектНаСервере.НомерСчетаФактуры = РаботаСНДС.ПолучитьНомерСчетаФактуры(ОбъектНаСервере);
	
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");

	ЗаполнитьДополнительныеКолонкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрисвоитьНомерСчетаФактурыВыданного(Команда)
	
	КомандаПрисвоитьНомерСчетаФактурыВыданногоНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПредварительноПриИзменении(Элемент)
	
	Если Объект.Предварительно Тогда
		Объект.ПрочиеДоходыИРасходы = ПолучитьПрочиеДоходыИРасходы(Объект);
	Иначе
		Объект.ПрочиеДоходыИРасходы = ПредопределенноеЗначение("Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка");
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура НомерАктаВыданногоПриИзменении(Элемент)
	
	Если Не Объект.Ссылка.Пустая() Тогда	
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "НомерАктаВыданного", ЭтаФорма.НомерАктаВыданного);					
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаНаОплатуВыданногоПриИзменении(Элемент)
	
	Если Не Объект.Ссылка.Пустая() Тогда	
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "НомерСчетаВыданного", ЭтаФорма.НомерСчетаНаОплатуВыданного);					
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительНуженПриИзменении(Элемент)
	
	Если НЕ ГрузоотправительНужен Тогда
		Объект.Грузоотправитель = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
		ЭтаФорма.Модифицированность = Истина;
		ОбновитьКППНаСервере();
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Основания.ТекущиеДанные;
	СтрокаТаблицы.ЕдиницаИзмеренияКод = СтрокаТаблицы.ЕдиницаИзмерения;
	СтрокаТаблицы.ЕдиницаИзмерения = Элемент.ТекстРедактирования;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКППНаСервере()
	
	ЭтаФорма.КПП = "";

	Если ЗначениеЗаполнено(Объект.Контрагент) ИЛИ ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КППКрупнейшегоНалогоплательщика <> """"
			|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КППКрупнейшегоНалогоплательщика
			|		ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.КПП
			|	КОНЕЦ КАК КПП
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|			&Дата,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("ЮрФизЛицо", ?(ЗначениеЗаполнено(Объект.Грузоотправитель), Объект.Грузоотправитель, Объект.Контрагент));
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЭтаФорма.КПП = ВыборкаДетальныеЗаписи.КПП;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ОбновитьКППНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СодержаниеИспользуетсяДляХраненияДанных(ВидЗадолженности) 
	Возврат Документы.НачислениеЗадолженности.СодержаниеИспользуетсяДляХраненияДанных(ВидЗадолженности)
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдиницыИзмерениеНаСервере()
	Возврат Документы.НачислениеЗадолженности.ПолучитьСписокЕдиницИзмерения();
КонецФункции

&НаКлиенте
Функция СформироватьСтруктуруПараметровРасчета(Отказ)
	
	СтруктураПараметров = Новый Структура();
	
	ЕдиницыИзмерения = ПолучитьЕдиницыИзмерениеНаСервере(); 
	
	Для Каждого ТекущаяСтрока Из Объект.Основания Цикл
	
		Если Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНалогуНаИмущество") Тогда
			
			СтруктураПараметровРасчета = Новый Структура();
			СтруктураПараметровРасчета.Вставить("СтавкаНалога", 				ТекущаяСтрока.СтавкаНалога);
			СтруктураПараметровРасчета.Вставить("БазаНалога", 					ТекущаяСтрока.БазаНалога);
			СтруктураПараметровРасчета.Вставить("АвансПоНалогу", 				ТекущаяСтрока.АвансПоНалогу);
			СтруктураПараметровРасчета.Вставить("РасчетПоКадастровойСтоимости", ТекущаяСтрока.РасчетПоКадастровойСтоимости);
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.ОбъектРасчетаНалогаНаИмущество) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект расчета налога в строке " + ТекущаяСтрока.ИсходныйНомерСтроки + " не заполнен!", 
						Объект.Ссылка, 
						"Основания[" + (ТекущаяСтрока.ИсходныйНомерСтроки - 1) + "].ОбъектРасчетаНалогаНаИмущество", 
						"Объект", 
						Отказ);
			Иначе
				Если ТипЗнч(ТекущаяСтрока.ОбъектРасчетаНалогаНаИмущество) = Тип("Строка") Тогда
					СтруктураПараметровРасчета.Вставить("КодОКТМО", 				ТекущаяСтрока.ОбъектРасчетаНалогаНаИмущество);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект расчета налога в строке " + ТекущаяСтрока.ИсходныйНомерСтроки + " должен содержать код ОКТМО!", 
						Объект.Ссылка, 
						"Основания[" + (ТекущаяСтрока.ИсходныйНомерСтроки - 1) + "].ОбъектРасчетаНалогаНаИмущество", 
						"Объект", 
						Отказ);
				КонецЕсли;
			КонецЕсли;
			
			СтруктураПараметров.Вставить("РасчетНалога", СтруктураПараметровРасчета);
			
		ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоАрендеПеременнаяЧасть") Тогда
			
			СтруктураПараметровКоммунальныхУслуг = Новый Структура();
			СтруктураПараметровКоммунальныхУслуг.Вставить("Количество", 			ТекущаяСтрока.Количество);
			СтруктураПараметровКоммунальныхУслуг.Вставить("Описание", 				ТекущаяСтрока.Описание);
			СтруктураПараметровКоммунальныхУслуг.Вставить("ЕдиницаИзмерения", 		ТекущаяСтрока.ЕдиницаИзмерения);
			СтруктураПараметровКоммунальныхУслуг.Вставить("ЕдиницаИзмеренияКод", 	ТекущаяСтрока.ЕдиницаИзмеренияКод);
			
			СтруктураПараметров.Вставить("КоммунальныеУслуги", СтруктураПараметровКоммунальныхУслуг);
			
		КонецЕсли;
		
		ТекущаяСтрока.Содержание = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураПараметров);
		
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоНалог(ВидЗадолженности)
	Возврат ЗначениеЗаполнено(ВидЗадолженности) И ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.Налоги);
КонецФункции

&НаСервере
Процедура ПолучитьПараметрыСтрокиОснованияНаСервере(ТекущаяСтрока)
	
	ДополнительныеДанные = Документы.НачислениеЗадолженности.ПолучитьДополнительныеДанныеИзСодержания(ТекущаяСтрока.Содержание);
	
	Если Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаИмущество Тогда
		РасчетНалога = Неопределено;
		Если ДополнительныеДанные <> Неопределено И ДополнительныеДанные.Свойство("РасчетНалога", РасчетНалога) Тогда
			РасчетНалога.Свойство("СтавкаНалога", ТекущаяСтрока.СтавкаНалога);
			РасчетНалога.Свойство("БазаНалога", ТекущаяСтрока.БазаНалога);
			РасчетНалога.Свойство("АвансПоНалогу", ТекущаяСтрока.АвансПоНалогу);
			РасчетНалога.Свойство("РасчетПоКадастровойСтоимости", ТекущаяСтрока.РасчетПоКадастровойСтоимости);
			РасчетНалога.Свойство("КодОКТМО", ТекущаяСтрока.ОбъектРасчетаНалогаНаИмущество);
		КонецЕсли;
	ИначеЕсли Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть Тогда
		КоммунальныеУслуги = Неопределено;
		Если ДополнительныеДанные = Неопределено Тогда
			ТекущаяСтрока.Описание = ТекущаяСтрока.Содержание;
		ИначеЕсли ДополнительныеДанные.Свойство("КоммунальныеУслуги", КоммунальныеУслуги) Тогда
			КоммунальныеУслуги.Свойство("Количество", ТекущаяСтрока.Количество);
			КоммунальныеУслуги.Свойство("ЕдиницаИзмерения", ТекущаяСтрока.ЕдиницаИзмерения);
			КоммунальныеУслуги.Свойство("ЕдиницаИзмеренияКод", ТекущаяСтрока.ЕдиницаИзмеренияКод);
			КоммунальныеУслуги.Свойство("Описание", ТекущаяСтрока.Описание);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолонкиНаСервере()
	
	Если Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаИмущество Тогда
		
		Если Элементы.Найти("ОснованияБазаНалога") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("БазаНалога", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(19,2)), "Объект.Основания", "База налога", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияБазаНалога", Тип("ПолеФормы"), Элементы.Основания); 
			Элементы.Переместить(нЭлемент, Элементы.Основания, Элементы.ОснованияСумма);
			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным = "Объект.Основания.БазаНалога"; 
			нЭлемент.УстановитьДействие("ПриИзменении", "ОснованияБазаИСтавкаНалогаПриИзменении");
	    КонецЕсли;
		
		Если Элементы.Найти("ОснованияСтавкаНалога") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("СтавкаНалога", Новый ОписаниеТипов("Число"), "Объект.Основания", "Ставка налога", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияСтавкаНалога", Тип("ПолеФормы"), Элементы.Основания); 
			Элементы.Переместить(нЭлемент, Элементы.Основания, Элементы.ОснованияСумма);
			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным = "Объект.Основания.СтавкаНалога"; 
			нЭлемент.УстановитьДействие("ПриИзменении", "ОснованияБазаИСтавкаНалогаПриИзменении");
		КонецЕсли;
		
		Если Элементы.Найти("ОснованияАвансПоНалогу") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("АвансПоНалогу", Новый ОписаниеТипов("Число"), "Объект.Основания", "Аванс по налогу", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияАвансПоНалогу", Тип("ПолеФормы"), Элементы.Основания); 
			Элементы.Переместить(нЭлемент, Элементы.Основания, Элементы.ОснованияСумма);
			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным = "Объект.Основания.АвансПоНалогу"; 
			нЭлемент.УстановитьДействие("ПриИзменении", "ОснованияБазаИСтавкаНалогаПриИзменении");
		КонецЕсли;
		
		Если Элементы.Найти("ОснованияОбъектРасчетаНалогаНаИмущество") = Неопределено Тогда 
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("Строка"));
			
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("ОбъектРасчетаНалогаНаИмущество", Новый ОписаниеТипов(МассивТипов,,,,Новый КвалификаторыСтроки(11)), "Объект.Основания", "Объект расчета", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияОбъектРасчетаНалогаНаИмущество", Тип("ПолеФормы"), Элементы.Основания); 
			Элементы.Переместить(нЭлемент, Элементы.Основания, Элементы.ОснованияБазаНалога);
			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным = "Объект.Основания.ОбъектРасчетаНалогаНаИмущество"; 
			нЭлемент.УстановитьДействие("ПриИзменении", "ОснованияОбъектРасчетаНалогаНаИмуществоПриИзменении");
		КонецЕсли;
		
		Если Элементы.Найти("ОснованияРасчетПоКадастровойСтоимости") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("РасчетПоКадастровойСтоимости", Новый ОписаниеТипов("Булево"), "Объект.Основания", "По кадастровой стоимости", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияРасчетПоКадастровойСтоимости", Тип("ПолеФормы"), Элементы.Основания); 
			Элементы.Переместить(нЭлемент, Элементы.Основания, Элементы.ОснованияБазаНалога);
			нЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
			нЭлемент.ПутьКДанным = "Объект.Основания.РасчетПоКадастровойСтоимости"; 
			нЭлемент.УстановитьДействие("ПриИзменении", "ОснованияРасчетПоКадастровойСтоимостиПриИзменении");
		КонецЕсли;
		
	ИначеЕсли Объект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть И Не Объект.Предварительно Тогда
		
		Если Элементы.Найти("ОснованияКоличество") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("Количество", Новый ОписаниеТипов("Число"), "Объект.Основания", "Количество", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияКоличество", Тип("ПолеФормы"), Элементы.Основания); 
			нЭлемент.АвтоМаксимальнаяШирина = Ложь;
			нЭлемент.МаксимальнаяШирина = 10;
			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным = "Объект.Основания.Количество"; 
		КонецЕсли;
		
		Если Элементы.Найти("ОснованияЕдиницаИзмерения") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка"), "Объект.Основания", "Единица измерения", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияЕдиницаИзмерения", Тип("ПолеФормы"), Элементы.Основания); 
			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.АвтоМаксимальнаяШирина = Ложь;
			нЭлемент.МаксимальнаяШирина = 6;
			нЭлемент.ПутьКДанным = "Объект.Основания.ЕдиницаИзмерения"; 
			нЭлемент.РежимВыбораИзСписка = Истина;
			нЭлемент.СписокВыбора.Очистить();
			СписокЕдиницИзмерения = Документы.НачислениеЗадолженности.ПолучитьСписокЕдиницИзмерения();
			Для Каждого Единица Из СписокЕдиницИзмерения Цикл
				нЭлемент.СписокВыбора.Добавить(Единица.Значение, Единица.Представление);
			КонецЦикла;
			нЭлемент.УстановитьДействие("ПриИзменении", "ОснованияЕдиницаИзмеренияПриИзменении");
		КонецЕсли;
		
		Если Элементы.Найти("ОснованияЕдиницаИзмеренияКод") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("ЕдиницаИзмеренияКод", Новый ОписаниеТипов("Строка"), "Объект.Основания", "Код единицы измерения", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияЕдиницаИзмеренияКод", Тип("ПолеФормы"), Элементы.Основания); 
			нЭлемент.ПутьКДанным = "Объект.Основания.ЕдиницаИзмеренияКод"; 
			нЭлемент.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.Найти("ОснованияОписание") = Неопределено Тогда 
			нРеквизиты = Новый Массив;
			нРеквизиты.Добавить(Новый РеквизитФормы("Описание", Новый ОписаниеТипов("Строка"), "Объект.Основания", "Описание", Истина));
			ИзменитьРеквизиты(нРеквизиты);
			
			нЭлемент = Элементы.Добавить("ОснованияОписание", Тип("ПолеФормы"), Элементы.Основания); 
			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным = "Объект.Основания.Описание"; 
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Документы.НачислениеЗадолженности.СодержаниеИспользуетсяДляХраненияДанных(Объект.ВидЗадолженности) Тогда
		Для Каждого Строка из Объект.Основания Цикл
			ТекущаяСтрока = Строка;
			ПолучитьПараметрыСтрокиОснованияНаСервере(ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте 
Процедура РассчитатьСуммуНалога(ТекущиеДанные)
	
	ТекущиеДанные.Сумма = Окр(ТекущиеДанные.БазаНалога * ТекущиеДанные.СтавкаНалога/100, 0) - ТекущиеДанные.АвансПоНалогу;
	
КонецПроцедуры	

&НаСервере 
Функция ПолучитьОбъектНедвижимостиПоОКТМОНаСервере(Организация, СчетДоверительногоУправления, КодОКТМО, Период)
	
	Возврат Справочники.ОбъектыНедвижимости.ПолучитьОбъектИмуществаДляКодаОКТМО(
		Организация, 
		СчетДоверительногоУправления, 
		КодОКТМО, 
		Период);
	
КонецФункции 

#Область Работа_с_переключателями_отправителя_и_получателя

&НаСервереБезКонтекста
Функция ОпределитьЗначениеПереключателя(Брокер, МестоХранения)

	Если ЗначениеЗаполнено(Брокер) Тогда
		Возврат ЗначениеПереключателяБрокер();
	ИначеЕсли МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК Тогда
		Возврат ЗначениеПереключателяБиржа();
	Иначе
		Возврат ЗначениеПереключателяПрямая();
	КонецЕсли;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяПрямая()
	Возврат 0;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяБрокер()
	Возврат 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяБиржа()
	Возврат 2;
КонецФункции

&НаКлиенте
Процедура ВозмещениеПоАрендеПриИзменении(Элемент)
	
	Если Не ВозмещениеПоАренде Тогда
		Объект.Арендатор = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
		Объект.ДоговорАренды = ПредопределенноеЗначение("Справочник.Договоры.ПустаяСсылка");
		Объект.ДатаОплатыАренды = '00010101';
	КонецЕсли;	
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДополнительныйДокументПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДополнительногоДокументаПриИзменении(Элемент)
	
	Если Не Объект.Ссылка.Пустая() Тогда	
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "ВидДополнительногоДокумента", ЭтаФорма.ВидДополнительногоДокумента);					
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДополнительногоДокументаПриИзменении(Элемент)
	
	Если Не Объект.Ссылка.Пустая() Тогда	
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "НомерДополнительногоДокумента", ЭтаФорма.НомерДополнительногоДокумента);					
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДополнительногоДокументаПриИзменении(Элемент)
	
	Если Не Объект.Ссылка.Пустая() Тогда	
		ЗаписатьДанныеОДокументеВДопСведенияНаСервере(Объект.Ссылка, "ДатаДополнительногоДокумента", ЭтаФорма.ДатаДополнительногоДокумента);					
	Конецесли;
	
КонецПроцедуры
		
#КонецОбласти

&НаСервереБезКонтекста
Функция РедактируемыеДополнительныеСведения()
	
	ВариантыКлюча = Новый Массив;
	ВариантыКлюча.Добавить("НомерАктаВыданного");
	ВариантыКлюча.Добавить("НомерСчетаВыданного");
	ВариантыКлюча.Добавить("ВидДополнительногоДокумента");
	ВариантыКлюча.Добавить("НомерДополнительногоДокумента");
	ВариантыКлюча.Добавить("ДатаДополнительногоДокумента");

    Возврат ВариантыКлюча;

КонецФункции

#КонецОбласти
